
public class View {
	// field
	
	// constructor
	
	// method
	public void startView() {
		System.out.println("\n\n");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ ■ □ □ □ □ □ □ □ □ □ □ □ □ □ □ ■ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ ■ □ □ □ □ □ □ □ □ □ □ □ □ □ □ ■ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ ■ □ □ □ □ □ □ □ □ □ □ □ □ ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ ■ □ □ □ □ □ □ □ □ □ □ □ □ ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ ■ □ □ □ ■ □ □ □ □ ■ □ □ □ ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ ■ □ □ □ □ □ □ □ □ □ □ □ □ ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ ■ □ □ ■ □ □ □ □ □ □ ■ □ □ ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ ■ □ □ □ ■ ■ ■ ■ ■ ■ □ □ □ ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ ■ □ □ □ □ □ □ □ □ □ □ □ □ ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ ■ □ □ □ □ □ □ □ □ □ □ □ □ ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
	}
	
	public void successView() {
		System.out.println("\n\n");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ ■ ■ ■ □ ■ □ ■ □ ■ ■ ■ □ ■ ■ ■ □ ■ ■ ■ □ ■ ■ ■ □ ■ ■ ■ □ ■ □");
		System.out.println("\t\t□ ■ □ □ □ ■ □ ■ □ ■ □ □ □ ■ □ □ □ ■ □ □ □ ■ □ □ □ ■ □ □ □ ■ □");
		System.out.println("\t\t□ ■ ■ ■ □ ■ □ ■ □ ■ □ □ □ ■ □ □ □ ■ ■ ■ □ ■ ■ ■ □ ■ ■ ■ □ ■ □");
		System.out.println("\t\t□ □ □ ■ □ ■ □ ■ □ ■ □ □ □ ■ □ □ □ ■ □ □ □ □ □ ■ □ □ □ ■ □ □ □");
		System.out.println("\t\t□ ■ ■ ■ □ ■ ■ ■ □ ■ ■ ■ □ ■ ■ ■ □ ■ ■ ■ □ ■ ■ ■ □ ■ ■ ■ □ ■ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n");
	}
	public void failView() {
		System.out.println("\n\n");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ ■ ■ ■ □ □ ■ □ □ ■ ■ ■ □ ■ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ ■ □ □ □ ■ □ ■ □ □ ■ □ □ ■ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ ■ ■ ■ □ ■ ■ ■ □ □ ■ □ □ ■ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ ■ □ □ □ ■ □ ■ □ □ ■ □ □ ■ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ ■ □ □ □ ■ □ ■ □ ■ ■ ■ □ ■ ■ ■ □ ■ □ ■ □ ■ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n");
	}
	
	public void storeView() {
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■                   ■                       ■                   ■");
		System.out.println("\t\t■      1. 케 이 크    ■         2. 빵         ■     3. 식 빵 &     ■");
		System.out.println("\t\t■                   ■                       ■     롤 케 이 크     ■");
		System.out.println("\t\t■                   ■                       ■                   ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■                                                               ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■                   ■                       ■                   ■");
		System.out.println("\t\t■      4. 제 조 실    ■       5. 카 운 터      ■    4. 샐 러 드 &    ■");
		System.out.println("\t\t■                   ■                       ■     샌 드 위 치     ■");
		System.out.println("\t\t■                   ■                       ■                   ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n");
	}
	public void createArea1() {
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ ■ ■ ■ ■ ■ ■ ■ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ ■   🍓🍓🍓🍓   ■ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ ■   🍓 🍓🍓🍓 🍓   ■ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ ■ ■   🍓🍓🍓🍓   ■ ■ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ ■   ■ ■ ■ ■ ■ ■ ■   ■ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ ■                   ■ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ ■ ■                   ■ ■ ■ ■ ■ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ ■   ■                   ■     ■ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ ■       ■               ■     ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ ■           ■ ■ ■ ■ ■ ■ ■     ■ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ ■                             ■ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □   Cake  □ □ □ □ □ □ □ □ □ □ □ □ □ □ □"); 
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n");
	}
	public void createArea2() {
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ ■ ■ ■ ■ ■ ■ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ ■             ■ □ ■ ■ ■ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ ■ ■ ■                 ■       ■ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ ■       ■                 ■       ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ ■           ■                         ■ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ ■                                       ■ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ ■                                       ■ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ ■                                     ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ ■                                 ■ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □   Bread   □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n");
	}
	public void createArea3() {
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ ■ ■ ■ ■ ■ ■ ■ ■ ■ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ ■ ■                   ■ ■ □ □ □ □ □ □ □ □ □ □"); 
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ ■                           ■ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ ■                               ■ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ ■                           ■ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ ■                       ■ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ ■                       ■ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ ■                       ■ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ ■                       ■ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □   WhiteBread & Rollcake   □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n");
	}
	public void createArea4() {
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ ■ ■ □ ■ ■ □ ■ ■ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ ■     ■     ■     ■ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ ■ ■ ■ ■ ■ ■ ■ ■ □ ■ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ ■                 ■   ■ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ ■                 ■   ■ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ ■             ■   ■ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ ■             ■   ■ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ ■             ■ ■ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ ■             ■   ■ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ ■             ■   ■ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ ■ ■ ■ ■ ■ ■ ■ ■ ■ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □  Sandwich & Salad □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t□ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □ □");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n");
	}
	
	// 단순화된 product를 이용한 제품 뷰 
	public void area1View2(Product p[]) {	
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■   " + p[0].name + "        " + p[1].name + "        " + p[2].name + "    ■");
		System.out.println("\t\t■        " + p[0].price + "원\t\t\t" + p[1].price + "원\t\t    " + p[2].price + "원      ■");
		System.out.println("\t\t■\t  " + p[0].count + "개\t\t\t  " + p[1].count + "개\t\t      " + p[2].count + "개        ■");
		System.out.println("\t\t■\t  " + p[0].day + "일\t\t\t  " + p[1].day + "일\t\t      " + p[2].day + "일        ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■\t\t" + p[3].name + "        " + p[4].name + "\t\t■");
		System.out.println("\t\t■\t\t      " + p[3].price + "원\t\t  " + p[4].price + "원\t        ■");
		System.out.println("\t\t■\t\t\t" + p[3].count + "개\t\t    " + p[4].count + "개\t\t\t■");
		System.out.println("\t\t■\t\t\t" + p[3].day + "일\t\t    " + p[4].day + "일\t\t\t■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■\t\t" + p[5].name + "        " + p[6].name + "\t\t\t■");
		System.out.println("\t\t■\t\t      " + p[5].price + "원\t\t  " + p[6].price + "원\t        ■");
		System.out.println("\t\t■\t\t\t" + p[5].count + "개\t\t    " + p[6].count + "개\t\t\t■");
		System.out.println("\t\t■\t\t\t" + p[5].day + "일\t\t    " + p[6].day + "일\t\t\t■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
	}
	public void area2View2(Product p[]) {
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■   " + p[7].name + "\t\t" + p[8].name + "\t\t" + p[9].name + "\t\t" + p[10].name + "    ■");
		System.out.println("\t\t■   " + p[7].price + "원\t\t" + p[8].price + "원\t\t" + p[9].price + "원\t\t" + p[10].price + "원   ■");
		System.out.println("\t\t■     " + p[7].count + "개\t\t " + p[8].count + "개\t\t " + p[9].count + "개\t\t " + p[10].count + "개     ■");
		System.out.println("\t\t■     " + p[7].day + "일\t\t " + p[8].day + "일\t\t " + p[9].day + "일\t\t " + p[10].day + "일     ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■   " + p[11].name + "\t\t" + p[12].name + "\t\t" + p[13].name + "\t\t" + p[14].name + "   ■");
		System.out.println("\t\t■   " + p[11].price + "원\t\t" + p[12].price + "원\t\t" + p[13].price + "원\t\t" + p[14].price + "원   ■");
		System.out.println("\t\t■     " + p[11].count + "개\t\t " + p[12].count + "개\t\t " + p[13].count + "개\t\t " + p[14].count + "개     ■");
		System.out.println("\t\t■     " + p[11].day + "일\t\t " + p[12].day + "일\t\t " + p[13].day + "일\t\t " + p[14].day + "일     ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■   " + p[15].name + "\t\t" + p[16].name + "\t\t" + p[17].name + "\t\t" + p[18].name + "     ■");
		System.out.println("\t\t■   " + p[15].price + "원\t\t" + p[16].price + "원\t\t" + p[17].price + "원\t\t" + p[18].price + "원   ■");
		System.out.println("\t\t■     " + p[15].count + "개\t\t " + p[16].count + "개\t\t " + p[17].count + "개\t\t " + p[18].count + "개     ■");
		System.out.println("\t\t■     " + p[15].day + "일\t\t " + p[16].day + "일\t\t " + p[17].day + "일\t\t " + p[18].day + "일     ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■     " + p[19].name + "\t      " + p[20].name + "\t\t" + p[21].name + "\t\t" + p[22].name + " ■");
		System.out.println("\t\t■   " + p[19].price + "원\t      " + p[20].price + "원\t\t" + p[21].price + "원\t\t" + p[22].price + "원   ■");
		System.out.println("\t\t■     " + p[19].count + "개\t        " + p[20].count + "개\t\t " + p[21].count + "개\t\t " + p[22].count + "개     ■");
		System.out.println("\t\t■     " + p[19].day + "일\t\t " + p[20].day + "일\t\t " + p[21].day + "일\t\t " + p[22].day + "일     ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
	}
	
	public void area3View2(Product p[]) {
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■  " + p[23].name + "\t\t" + p[24].name + "\t\t" + p[25].name + "\t\t" + p[26].name + "  ■");
		System.out.println("\t\t■   " + p[23].price + "원\t\t" + p[24].price + "원\t\t" + p[25].price + "원\t\t" + p[26].price + "원   ■");
		System.out.println("\t\t■     " + p[23].count + "개\t\t " + p[24].count + "개\t\t " + p[25].count + "개\t\t " + p[26].count + "개     ■");
		System.out.println("\t\t■     " + p[23].day + "일\t\t " + p[24].day + "일\t\t " + p[25].day + "일\t\t " + p[26].day + "일     ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■  " + p[27].name + "\t      " + p[28].name + "      " + p[29].name + "\t" + p[30].name + " ■");
		System.out.println("\t\t■   " + p[27].price + "원\t\t" + p[28].price + "원\t\t" + p[29].price + "원\t\t" + p[30].price + "원  ■");
		System.out.println("\t\t■     " + p[27].count + "개\t\t " + p[28].count + "개\t\t " + p[29].count + "개\t\t " + p[30].count + "개     ■");
		System.out.println("\t\t■     " + p[27].day + "일\t\t " + p[28].day + "일\t\t " + p[29].day + "일\t\t " + p[30].day + "일     ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
	}
	
	public void area4View2(Product p[]) {
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■    " + p[31].name + "\t\t" + p[32].name + "\t\t" + p[35].name + "     ■");
		System.out.println("\t\t■     " + p[31].price + "원\t\t   " + p[32].price + "원\t\t    " + p[35].price + "원       ■");
		System.out.println("\t\t■       " + p[31].count + "개\t\t    " + p[32].count + "개\t\t\t     " + p[35].count + "개         ■");
		System.out.println("\t\t■       " + p[31].day + "일\t\t    " + p[32].day + "일\t\t\t     " + p[35].day + "일         ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■  " + p[33].name + "\t\t" + p[34].name + "\t\t" + p[36].name + "     ■");
		System.out.println("\t\t■     " + p[33].price + "원\t\t   " + p[34].price + "원\t\t    " + p[36].price + "원       ■");
		System.out.println("\t\t■       " + p[33].count + "개\t\t    " + p[34].count + "개\t\t\t     " + p[36].count + "개         ■");
		System.out.println("\t\t■       " + p[33].day + "일\t\t    " + p[34].day + "일\t\t\t     " + p[36].day + "일         ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
	}
	
	
	// 세분화된 product를 이용한 제품 뷰 
	public void area1View(Product c[]) {	
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■   " + c[0].name + "        " + c[1].name + "        " + c[2].name + "    ■");
		System.out.println("\t\t■        " + c[0].price + "원\t\t\t" + c[1].price + "원\t\t    " + c[2].price + "원      ■");
		System.out.println("\t\t■\t  " + c[0].count + "개\t\t\t  " + c[1].count + "개\t\t      " + c[2].count + "개        ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■\t\t" + c[3].name + "        " + c[4].name + "\t\t■");
		System.out.println("\t\t■\t\t      " + c[3].price + "원\t\t  " + c[4].price + "원\t        ■");
		System.out.println("\t\t■\t\t\t" + c[3].count + "개\t\t    " + c[4].count + "개\t\t\t■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■\t\t" + c[5].name + "        " + c[6].name + "\t\t\t■");
		System.out.println("\t\t■\t\t      " + c[5].price + "원\t\t  " + c[6].price + "원\t        ■");
		System.out.println("\t\t■\t\t\t" + c[5].count + "개\t\t    " + c[6].count + "개\t\t\t■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
	}
	
	public void area2View(Product b[]) {
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■   " + b[0].name + "\t\t" + b[1].name + "\t\t" + b[2].name + "\t\t" + b[3].name + "    ■");
		System.out.println("\t\t■   " + b[0].price + "원\t\t" + b[1].price + "원\t\t" + b[2].price + "원\t\t" + b[3].price + "원   ■");
		System.out.println("\t\t■     " + b[0].count + "개\t\t " + b[1].count + "개\t\t " + b[2].count + "개\t\t " + b[3].count + "개     ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■   " + b[4].name + "\t\t" + b[5].name + "\t\t" + b[6].name + "\t\t" + b[7].name + "   ■");
		System.out.println("\t\t■   " + b[4].price + "원\t\t" + b[5].price + "원\t\t" + b[6].price + "원\t\t" + b[7].price + "원   ■");
		System.out.println("\t\t■     " + b[4].count + "개\t\t " + b[5].count + "개\t\t " + b[6].count + "개\t\t " + b[7].count + "개     ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■   " + b[8].name + "\t\t" + b[9].name + "\t\t" + b[10].name + "\t\t" + b[11].name + "     ■");
		System.out.println("\t\t■   " + b[8].price + "원\t\t" + b[9].price + "원\t\t" + b[10].price + "원\t\t" + b[11].price + "원   ■");
		System.out.println("\t\t■     " + b[8].count + "개\t\t " + b[9].count + "개\t\t " + b[10].count + "개\t\t " + b[11].count + "개     ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■     " + b[12].name + "\t      " + b[13].name + "\t\t" + b[14].name + "\t\t" + b[15].name + " ■");
		System.out.println("\t\t■   " + b[12].price + "원\t      " + b[13].price + "원\t\t" + b[14].price + "원\t\t" + b[15].price + "원   ■");
		System.out.println("\t\t■     " + b[12].count + "개\t        " + b[13].count + "개\t\t " + b[14].count + "개\t\t " + b[15].count + "개     ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
	}
	
	public void area3View(Product w[]) {
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■  " + w[0].name + "\t\t" + w[1].name + "\t\t" + w[2].name + "\t\t" + w[3].name + "  ■");
		System.out.println("\t\t■   " + w[0].price + "원\t\t" + w[1].price + "원\t\t" + w[2].price + "원\t\t" + w[3].price + "원   ■");
		System.out.println("\t\t■     " + w[0].count + "개\t\t " + w[1].count + "개\t\t " + w[2].count + "개\t\t " + w[3].count + "개     ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■  " + w[4].name + "\t      " + w[5].name + "      " + w[6].name + "\t" + w[7].name + " ■");
		System.out.println("\t\t■   " + w[4].price + "원\t\t" + w[5].price + "원\t\t" + w[6].price + "원\t\t" + w[7].price + "원  ■");
		System.out.println("\t\t■     " + w[4].count + "개\t\t " + w[5].count + "개\t\t " + w[6].count + "개\t\t " + w[7].count + "개     ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
	}
	
	public void area4View(Product s[]) {
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■    " + s[0].name + "\t\t" + s[1].name + "\t\t" + s[4].name + "     ■");
		System.out.println("\t\t■     " + s[0].price + "원\t\t   " + s[1].price + "원\t\t    " + s[4].price + "원       ■");
		System.out.println("\t\t■       " + s[0].count + "개\t\t    " + s[1].count + "개\t\t\t     " + s[4].count + "개         ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
		System.out.println("\t\t■  " + s[2].name + "\t\t" + s[3].name + "\t\t" + s[5].name + "     ■");
		System.out.println("\t\t■     " + s[2].price + "원\t\t   " + s[3].price + "원\t\t    " + s[5].price + "원       ■");
		System.out.println("\t\t■       " + s[2].count + "개\t\t    " + s[3].count + "개\t\t\t     " + s[5].count + "개         ■");
		System.out.println("\t\t■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■");
	}
	
	public void ManufacturingView() {
		
	}
	
	public void counterView1() {
		System.out.println("\t\t🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞\n");
		System.out.println("\t\t\t\t    1. 손님 받기 \t 2. 재고 채우기 ");
		System.out.println("\t\t\t\t\t숫자로 입력해 주세요. \n");
		System.out.println("\t\t🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞");
	}
	
	public void counterView2() {
		System.out.println("\t\t🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞\n");
		System.out.println("\t\t\t     Baker에게 생산을 요청할 제품의 이름을 적어주세요. ");
		System.out.println("\t\t\t\t    제품은 하나씩만 입력 가능합니다.  \n");
		System.out.println("\t\t🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞🍞");
	}
}
